#include "Dri_3Wire.h"

/**
 * @brief 向1302写入一个字节 [发送一个字节数据]
 * 
 * @param by 要写入的字节
 */
void Dri_3Wire_WriteByte(u8 by)
{
    u8 i;
    //准备上升沿
    SCLK = 0;

    //3Wire是串行协议,一次写一个位,而且从 低位开始写[3Wire,1Wire] "IIC协议是从高位开始写"
    for (i = 0; i < 8; i++)
    {
        //模仿1Wire来写
        //1. 把要发送的数据字节by的最低位保留,其他位置位0
        IO = by & 0x01;
        //2. 把时钟改为上升沿 让单片机写数据
        SCLK = 1; 
        //3. 把时钟改为下降沿 准备下次要写的数据
        SCLK = 0;
        //4. 把下一次要写的数据准备好
        by >>= 1;
    }
}

/**
 * @brief 从1302中读一个字节 [接收一个字节数据]
 * 
 * @return u8 被接收的字节
 */
u8 Dri_3Wire_ReadByte()
{
    //定义变量准备接收1302发送来的数据
    u8 by = 0;
    u8 i;
    

    //3Wire协议也是一位一位的读数据 [从低位开始读 -> 模仿1Wire协议]
    for (i = 0; i < 8; i++)
    {
        //1. 把要读的数据准备好 
        //举例 : I0 -> 1010 1010
        if (IO)
        {
            /*
             *  第一次循环(i = 0) : IO = 0 -> 不进if -> by = 0b00000000 ;
             *  第二次循环(i = 1) : IO = 1 ->   进if -> by = 0b00000010 ;
             *  第三次循环(i = 2) : IO = 0 -> 不进if -> by = 0b00000010 ;
             *  第四次循环(i = 3) : I0 = 1 ->   进if -> by = 0b00001010 ;
             */
            by |= (0x01 << i);  
            //结果by : 1010 1010
        }
        
        
        //2. 准备一个下降沿,单片机就可以读数据
        //为什么敢这样写 : 因为读是在写后面,每一次写完SCLK都置位0了
        SCLK = 1;
        SCLK = 0;
    }
    
    return by;
}

//模仿1Wire读数据时 操作数据的老逻辑
// /**
//  * @brief 从1302中读一个字节 [接收一个字节数据]
//  * 
//  * @return u8 被接收的字节
//  */
// u8 Dri_3Wire_ReadByte()
// {
//     //定义变量准备接收1302发送来的数据
//     u8 by = 0;
//     u8 i;
//     u8 temp;

//     //3Wire协议也是一位一位的读数据 [从低位开始读 -> 模仿1Wire协议]
//     for (i = 0; i < 8; i++)
//     {
//         //1. 把要读的数据准备好 
//         temp = IO;  
//         temp <<= i;
//         by |= temp;
        
//         //2. 准备一个下降沿,单片机就可以读数据
//         //为什么敢这样写 : 因为读是在写后面,每一次写完SCLK都置位0了
//         SCLK = 1;
//         SCLK = 0;
//     }
    
//     return by;
// }
